package com.example.renaissance.mock;

public class MockContentList {
    private static String[] contents = {
            "看过《达·芬奇密码》的人大概都知道达·芬奇密码筒。按照故事情节，密码筒里藏匿着关于郇山隐修会乃至整个基督教最大秘密的莎草纸。达·芬奇设计的密码筒内有一个装着醋液的容器，如果强行砸烂密码筒，醋液就会流出溶解莎草纸。要打开密码筒，必须解开一个5位数的密码，密码筒上有5个转盘，每个转盘上都有26个字母，可能作为密码的排列组合多达11881376种。达芬奇密码到底是怎么破解的？",
            "在文艺复兴这么一个讲究容貌漂亮和仪容的时代,米开朗基罗是个最不受人喜欢的人物.他中等身材,双肩宽阔,躯体瘦削,头大,眉高,两耳突出面颊,脸孔长而忧郁,鼻子低扁,眼睛虽锐利却很小。可以说，他的长相非常糟糕，不讨人喜欢。他不怎么喜欢漂亮女人,屋里有女人他就受不了.他也画女人,但总是画成熟的女人,而不是那种妩媚的少女.当时很多艺术家都认为人的肉体是美的体现和源泉,他却对女人的肉体美无动于衷。",
            "10岁的乔托(1270-1337年,意大利文艺复兴时期的大画家)是韦斯皮尼亚诺村里有名的聪明孩子,他能说会道,什么东西都一学就会,在他的字典里, 似乎从来没有“不懂”二字。他尤其爱好的是画画儿。看见马就画匹马,看见牛就画头牛。鸟儿在林子里歌唱,他就在地上画一只鸟;邻居的老伯伯从家门口走过, 他两笔三笔就画得惟妙惟肖。当然了,这个孩子人品也很好,懂礼貌,肯干活。因此，村子里的人们都很喜欢这个孩子。",
            "米开朗基罗的脾气也和他的雕塑与画作一样出名。当年轻英俊的拉斐尔第一次出现在罗马的舞台上，并迅速受到教皇利奥十世的任用时，米开朗基罗就把他视作了一个劲敌。之后，米开朗基罗还一再指责拉斐尔抄袭剽窃。为了不让拉斐尔看到自己的作品，米开朗基罗甚至一度躲在隔板后面制作他绘制在天花板上的杰作。而拉斐尔本人也不是吃素的，他想方设法看到了那幅作品，并在自己稍后的壁画《雅典学院》（The School of Athens）中加入了一个直接取自米开朗基罗作品的坐着的人像。",
            "16 世纪晚期，科学社会形成后，重大的科学竞争开始崭露头角。早期爆发的竞争中最知名的或许还要数牛顿和莱布尼茨之间的激烈之争。这两位伟人都声称自己是第一个创立微积分的人——如今公认的看法是，他们两人是各自独立创立了微积分。牛顿和莱布尼茨的长期斗争引发了英国和欧洲数学界之间的裂痕，以至于在一个多世纪中，英国和欧洲数学界几乎没有任何科学知识方面的交流。",
            "拉斐尔学习佩鲁吉诺的绘画风格时，在每一细节的模仿上都异常逼真，以至他绘制的肖像与老师的手迹如出一辙，真假难辨。如在佩鲁贾的圣弗朗西斯科教堂为曼达勒纳·德格里·奥迪夫人绘制的一幅木板画中，他用油彩绘制了许多人像，表现圣母升天的景象，耶稣在空中为圣母加冕，坟墓周围的十二门徒正凝视着天堂的光辉。这件作品制作得极为精细，任何不精通绘画风格的人都会误认为这是佩鲁吉诺的手迹。",
            "伦勃朗在绘画史——不独是荷兰的而是全欧的绘画史上所占的地位，是与意大利文艺复兴诸巨匠不相上下的。他所代表的是北欧的民族性与民族天才。造成伦勃朗的伟大的面目的，是表现他的特殊心魂的一种特殊技术。明暗法，这名词，一经用来谈到这位画家时，便具有一种特别的意义。换言之，伦勃朗的明暗和文艺复兴期意大利作家的明暗是有着截然不同的意义的。法国十九世纪画家兼批评家弗罗芒坦称他为“夜光虫”。又有人说他以黑暗来绘成光明。",
            "在文艺复兴这么一个讲究容貌漂亮和仪容的时代,米开朗基罗是个最不受人喜欢的人物.他中等身材,双肩宽阔,躯体瘦削,头大,眉高,两耳突出面颊,脸孔长而忧郁,鼻子低扁,眼睛虽锐利却很小。可以说，他的长相非常糟糕，不讨人喜欢。他不怎么喜欢漂亮女人,屋里有女人他就受不了.他也画女人,但总是画成熟的女人,而不是那种妩媚的少女.当时很多艺术家都认为人的肉体是美的体现和源泉,他却对女人的肉体美无动于衷。",
            "米开朗基罗的脾气也和他的雕塑与画作一样出名。当年轻英俊的拉斐尔第一次出现在罗马的舞台上，并迅速受到教皇利奥十世的任用时，米开朗基罗就把他视作了一个劲敌。之后，米开朗基罗还一再指责拉斐尔抄袭剽窃。为了不让拉斐尔看到自己的作品，米开朗基罗甚至一度躲在隔板后面制作他绘制在天花板上的杰作。而拉斐尔本人也不是吃素的，他想方设法看到了那幅作品，并在自己稍后的壁画《雅典学院》（The School of Athens）中加入了一个直接取自米开朗基罗作品的坐着的人像。",
            "拉斐尔学习佩鲁吉诺的绘画风格时，在每一细节的模仿上都异常逼真，以至他绘制的肖像与老师的手迹如出一辙，真假难辨。如在佩鲁贾的圣弗朗西斯科教堂为曼达勒纳·德格里·奥迪夫人绘制的一幅木板画中，他用油彩绘制了许多人像，表现圣母升天的景象，耶稣在空中为圣母加冕，坟墓周围的十二门徒正凝视着天堂的光辉。这件作品制作得极为精细，任何不精通绘画风格的人都会误认为这是佩鲁吉诺的手迹。",
            "伦勃朗在绘画史——不独是荷兰的而是全欧的绘画史上所占的地位，是与意大利文艺复兴诸巨匠不相上下的。他所代表的是北欧的民族性与民族天才。造成伦勃朗的伟大的面目的，是表现他的特殊心魂的一种特殊技术。明暗法，这名词，一经用来谈到这位画家时，便具有一种特别的意义。换言之，伦勃朗的明暗和文艺复兴期意大利作家的明暗是有着截然不同的意义的。法国十九世纪画家兼批评家弗罗芒坦称他为“夜光虫”。又有人说他以黑暗来绘成光明。",
            "乔托(1270-1337年,意大利文艺复兴时期的大画家)是韦斯皮尼亚诺村里有名的聪明孩子,他能说会道,什么东西都一学就会,在他的字典里, 似乎从来没有“不懂”二字。他尤其爱好的是画画儿。看见马就画匹马,看见牛就画头牛。鸟儿在林子里歌唱,他就在地上画一只鸟;邻居的老伯伯从家门口走过, 他两笔三笔就画得惟妙惟肖。当然了,这个孩子人品也很好,懂礼貌,肯干活。因此，村子里的人们都很喜欢这个孩子。"
    };

    public static String getContent(int id){
        return contents[id];
    }
}
